tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1829_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16F1829_H_
#define _PIC16F1829_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define IOCIF                         25
#define INTF                          26
#define T0IF                          27
#define TMR0IF                        28
#define IOCIE                         29
#define INTE                          30
#define T0IE                          31
#define TMR0IE                        32
#define PEIE                          33
#define GIE                           34
#define PORTA                         35
#define RA0                           36
#define RA1                           37
#define RA2                           38
#define RA3                           39
#define RA4                           40
#define RA5                           41
#define PORTB                         42
#define RB4                           43
#define RB5                           44
#define RB6                           45
#define RB7                           46
#define PORTC                         47
#define RC0                           48
#define RC1                           49
#define RC2                           50
#define RC3                           51
#define RC4                           52
#define RC5                           53
#define RC6                           54
#define RC7                           55
#define PIR1                          56
#define TMR1IF                        57
#define TMR2IF                        58
#define CCP1IF                        59
#define SSP1IF                        60
#define TXIF                          61
#define RCIF                          62
#define ADIF                          63
#define TMR1GIF                       64
#define PIR2                          65
#define CCP2IF                        66
#define BCL1IF                        67
#define EEIF                          68
#define C1IF                          69
#define C2IF                          70
#define OSFIF                         71
#define PIR3                          72
#define TMR4IF                        73
#define TMR6IF                        74
#define CCP3IF                        75
#define CCP4IF                        76
#define PIR4                          77
#define SSP2IF                        78
#define BCL2IF                        79
#define TMR0                          80
#define TMR1L                         81
#define TMR1H                         82
#define T1CON                         83
#define TMR1ON                        84
#define nT1SYNC                       85
#define T1OSCEN                       86
#define T1CKPS0                       87
#define T1CKPS                        88
#define T1CKPS1                       89
#define TMR1CS                        90
#define TMR1CS0                       91
#define TMR1CS1                       92
#define T1GCON                        93
#define T1GSS0                        94
#define T1GSS                         95
#define T1GSS1                        96
#define T1GVAL                        97
#define T1GGO                         98
#define T1GSPM                        99
#define T1GTM                         100
#define T1GPOL                        101
#define TMR1GE                        102
#define TMR2                          103
#define PR2                           104
#define T2CON                         105
#define T2CKPS0                       106
#define T2CKPS                        107
#define T2CKPS1                       108
#define TMR2ON                        109
#define T2OUTPS0                      110
#define T2OUTPS                       111
#define T2OUTPS1                      112
#define T2OUTPS2                      113
#define T2OUTPS3                      114
#define CPSCON0                       115
#define T0XCS                         116
#define CPSOUT                        117
#define CPSRNG                        118
#define CPSRNG0                       119
#define CPSRNG1                       120
#define CPSRM                         121
#define CPSON                         122
#define CPSCON1                       123
#define CPSCH                         124
#define CPSCH0                        125
#define CPSCH1                        126
#define CPSCH2                        127
#define CPSCH3                        128
#define TRISA                         129
#define TRISA0                        130
#define TRISA1                        131
#define TRISA2                        132
#define TRISA3                        133
#define TRISA4                        134
#define TRISA5                        135
#define TRISB                         136
#define TRISB4                        137
#define TRISB5                        138
#define TRISB6                        139
#define TRISB7                        140
#define TRISC                         141
#define TRISC0                        142
#define TRISC1                        143
#define TRISC2                        144
#define TRISC3                        145
#define TRISC4                        146
#define TRISC5                        147
#define TRISC6                        148
#define TRISC7                        149
#define PIE1                          150
#define TMR1IE                        151
#define TMR2IE                        152
#define CCP1IE                        153
#define SSP1IE                        154
#define TXIE                          155
#define RCIE                          156
#define ADIE                          157
#define TMR1GIE                       158
#define PIE2                          159
#define CCP2IE                        160
#define BCL1IE                        161
#define EEIE                          162
#define C1IE                          163
#define C2IE                          164
#define OSFIE                         165
#define PIE3                          166
#define TMR4IE                        167
#define TMR6IE                        168
#define CCP3IE                        169
#define CCP4IE                        170
#define PIE4                          171
#define SSP2IE                        172
#define BCL2IE                        173
#define OPTION_REG                    174
#define PS                            175
#define PS0                           176
#define PS1                           177
#define PS2                           178
#define PSA                           179
#define T0SE                          180
#define TMR0SE                        181
#define T0CS                          182
#define TMR0CS                        183
#define INTEDG                        184
#define nWPUEN                        185
#define PCON                          186
#define nBOR                          187
#define nPOR                          188
#define nRI                           189
#define nRMCLR                        190
#define STKUNF                        191
#define STKOVF                        192
#define WDTCON                        193
#define SWDTEN                        194
#define WDTPS                         195
#define WDTPS0                        196
#define WDTPS1                        197
#define WDTPS2                        198
#define WDTPS3                        199
#define WDTPS4                        200
#define OSCTUNE                       201
#define TUN0                          202
#define TUN                           203
#define TUN1                          204
#define TUN2                          205
#define TUN3                          206
#define TUN4                          207
#define TUN5                          208
#define OSCCON                        209
#define SCS0                          210
#define SCS                           211
#define SCS1                          212
#define IRCF                          213
#define IRCF0                         214
#define IRCF1                         215
#define IRCF2                         216
#define IRCF3                         217
#define SPLLEN                        218
#define OSCSTAT                       219
#define HFIOFS                        220
#define LFIOFR                        221
#define MFIOFR                        222
#define HFIOFL                        223
#define HFIOFR                        224
#define OSTS                          225
#define PLLR                          226
#define T1OSCR                        227
#define ADRESL                        228
#define ADRESH                        229
#define ADCON0                        230
#define ADON                          231
#define GO_nDONE                      232
#define GO                            233
#define ADGO                          234
#define CHS0                          235
#define CHS                           236
#define CHS1                          237
#define CHS2                          238
#define CHS3                          239
#define CHS4                          240
#define ADCON1                        241
#define ADPREF0                       242
#define ADPREF                        243
#define ADPREF1                       244
#define ADNREF                        245
#define ADCS0                         246
#define ADCS                          247
#define ADCS1                         248
#define ADCS2                         249
#define ADFM                          250
#define LATA                          251
#define LATA0                         252
#define LATA1                         253
#define LATA2                         254
#define LATA4                         255
#define LATA5                         256
#define LATB                          257
#define LATB4                         258
#define LATB5                         259
#define LATB6                         260
#define LATB7                         261
#define LATC                          262
#define LATC0                         263
#define LATC1                         264
#define LATC2                         265
#define LATC3                         266
#define LATC4                         267
#define LATC5                         268
#define LATC6                         269
#define LATC7                         270
#define CM1CON0                       271
#define C1SYNC                        272
#define C1HYS                         273
#define C1SP                          274
#define C1POL                         275
#define C1OE                          276
#define C1OUT                         277
#define C1ON                          278
#define CM1CON1                       279
#define C1NCH0                        280
#define C1NCH                         281
#define C1NCH1                        282
#define C1PCH                         283
#define C1PCH0                        284
#define C1PCH1                        285
#define C1INTN                        286
#define C1INTP                        287
#define CM2CON0                       288
#define C2SYNC                        289
#define C2HYS                         290
#define C2SP                          291
#define C2POL                         292
#define C2OE                          293
#define C2OUT                         294
#define C2ON                          295
#define CM2CON1                       296
#define C2NCH0                        297
#define C2NCH                         298
#define C2NCH1                        299
#define C2PCH                         300
#define C2PCH0                        301
#define C2PCH1                        302
#define C2INTN                        303
#define C2INTP                        304
#define CMOUT                         305
#define MC1OUT                        306
#define MC2OUT                        307
#define BORCON                        308
#define BORRDY                        309
#define SBOREN                        310
#define FVRCON                        311
#define ADFVR0                        312
#define ADFVR                         313
#define ADFVR1                        314
#define CDAFVR0                       315
#define CDAFVR                        316
#define CDAFVR1                       317
#define TSRNG                         318
#define TSEN                          319
#define FVRRDY                        320
#define FVREN                         321
#define DACCON0                       322
#define DACNSS                        323
#define DACPSS                        324
#define DACPSS0                       325
#define DACPSS1                       326
#define DACOE                         327
#define DACLPS                        328
#define DACEN                         329
#define DACCON1                       330
#define DACR0                         331
#define DACR                          332
#define DACR1                         333
#define DACR2                         334
#define DACR3                         335
#define DACR4                         336
#define SRCON0                        337
#define SRPR                          338
#define SRPS                          339
#define SRNQEN                        340
#define SRQEN                         341
#define SRCLK0                        342
#define SRCLK                         343
#define SRCLK1                        344
#define SRCLK2                        345
#define SRLEN                         346
#define SRCON1                        347
#define SRRC1E                        348
#define SRRC2E                        349
#define SRRCKE                        350
#define SRRPE                         351
#define SRSC1E                        352
#define SRSC2E                        353
#define SRSCKE                        354
#define SRSPE                         355
#define APFCON0                       356
#define TXCKSEL                       357
#define T1GSEL                        358
#define RXDTSEL                       359
#define APFCON1                       360
#define CCP2SEL                       361
#define P2BSEL                        362
#define P1CSEL                        363
#define P1DSEL                        364
#define SS2SEL                        365
#define SDO2SEL                       366
#define ANSA0                         367
#define ANSELA                        368
#define ANSA1                         369
#define ANSA2                         370
#define ANSA4                         371
#define ANSELB                        372
#define ANSB4                         373
#define ANSB5                         374
#define ANSC0                         375
#define ANSELC                        376
#define ANSC1                         377
#define ANSC2                         378
#define ANSC3                         379
#define ANSC6                         380
#define ANSC7                         381
#define EEADRL                        382
#define EEADRH                        383
#define EEDATL                        384
#define EEDATH                        385
#define EECON1                        386
#define RD                            387
#define WR                            388
#define WREN                          389
#define WRERR                         390
#define FREE                          391
#define LWLO                          392
#define CFGS                          393
#define EEPGD                         394
#define EECON2                        395
#define RCREG                         396
#define TXREG                         397
#define SPBRGL                        398
#define SPBRGH                        399
#define RCSTA                         400
#define RX9D                          401
#define OERR                          402
#define FERR                          403
#define ADDEN                         404
#define CREN                          405
#define SREN                          406
#define RX9                           407
#define SPEN                          408
#define TXSTA                         409
#define TX9D                          410
#define TRMT                          411
#define BRGH                          412
#define SENDB                         413
#define SYNC                          414
#define TXEN                          415
#define TX9                           416
#define CSRC                          417
#define BAUDCON                       418
#define ABDEN                         419
#define WUE                           420
#define BRG16                         421
#define SCKP                          422
#define RCIDL                         423
#define ABDOVF                        424
#define WPUA0                         425
#define WPUA                          426
#define WPUA1                         427
#define WPUA2                         428
#define WPUA3                         429
#define WPUA4                         430
#define WPUA5                         431
#define WPUB                          432
#define WPUB4                         433
#define WPUB5                         434
#define WPUB6                         435
#define WPUB7                         436
#define WPUC0                         437
#define WPUC                          438
#define WPUC1                         439
#define WPUC2                         440
#define WPUC3                         441
#define WPUC4                         442
#define WPUC5                         443
#define WPUC6                         444
#define WPUC7                         445
#define SSP1BUF                       446
#define SSP1BUF_SSPBUF                447
#define SSP1ADD                       448
#define SSP1ADD_SSPADD                449
#define SSP1MSK                       450
#define SSP1MSK_SSPMSK                451
#define SSP1STAT                      452
#define SSP1STAT_BF                   453
#define SSP1STAT_UA                   454
#define SSP1STAT_R_nW                 455
#define SSP1STAT_S                    456
#define SSP1STAT_P                    457
#define SSP1STAT_D_nA                 458
#define SSP1STAT_CKE                  459
#define SSP1STAT_SMP                  460
#define SSP1CON1                      461
#define SSP1CON1_SSPM                 462
#define SSP1CON1_SSPM0                463
#define SSP1CON1_SSPM1                464
#define SSP1CON1_SSPM2                465
#define SSP1CON1_SSPM3                466
#define SSP1CON1_CKP                  467
#define SSP1CON1_SSPEN                468
#define SSP1CON1_SSPOV                469
#define SSP1CON1_WCOL                 470
#define SSP1CON2                      471
#define SSP1CON2_SEN                  472
#define SSP1CON2_RSEN                 473
#define SSP1CON2_PEN                  474
#define SSP1CON2_RCEN                 475
#define SSP1CON2_ACKEN                476
#define SSP1CON2_ACKDT                477
#define SSP1CON2_ACKSTAT              478
#define SSP1CON2_GCEN                 479
#define SSP1CON3                      480
#define SSP1CON3_DHEN                 481
#define SSP1CON3_AHEN                 482
#define SSP1CON3_SBCDE                483
#define SSP1CON3_SDAHT                484
#define SSP1CON3_BOEN                 485
#define SSP1CON3_SCIE                 486
#define SSP1CON3_PCIE                 487
#define SSP1CON3_ACKTIM               488
#define SSP2BUF                       489
#define SSP2BUF_SSPBUF                490
#define SSP2ADD                       491
#define SSP2ADD_SSPADD                492
#define SSP2MSK                       493
#define SSP2MSK_SSPMSK                494
#define SSP2STAT                      495
#define SSP2STAT_BF                   496
#define SSP2STAT_UA                   497
#define SSP2STAT_R_nW                 498
#define SSP2STAT_S                    499
#define SSP2STAT_P                    500
#define SSP2STAT_D_nA                 501
#define SSP2STAT_CKE                  502
#define SSP2STAT_SMP                  503
#define SSP2CON1                      504
#define SSP2CON1_SSPM                 505
#define SSP2CON1_SSPM0                506
#define SSP2CON1_SSPM1                507
#define SSP2CON1_SSPM2                508
#define SSP2CON1_SSPM3                509
#define SSP2CON1_CKP                  510
#define SSP2CON1_SSPEN                511
#define SSP2CON1_SSPOV                512
#define SSP2CON1_WCOL                 513
#define SSP2CON2                      514
#define SSP2CON2_SEN                  515
#define SSP2CON2_RSEN                 516
#define SSP2CON2_PEN                  517
#define SSP2CON2_RCEN                 518
#define SSP2CON2_ACKEN                519
#define SSP2CON2_ACKDT                520
#define SSP2CON2_ACKSTAT              521
