tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1829_tdd.h
#define SSP2CON2_GCEN                 522
#define SSP2CON3                      523
#define SSP2CON3_DHEN                 524
#define SSP2CON3_AHEN                 525
#define SSP2CON3_SBCDE                526
#define SSP2CON3_SDAHT                527
#define SSP2CON3_BOEN                 528
#define SSP2CON3_SCIE                 529
#define SSP2CON3_PCIE                 530
#define SSP2CON3_ACKTIM               531
#define CCPR1L                        532
#define CCPR1H                        533
#define CCP1CON                       534
#define CCP1M0                        535
#define CCP1M                         536
#define CCP1M1                        537
#define CCP1M2                        538
#define CCP1M3                        539
#define DC1B                          540
#define DC1B0                         541
#define DC1B1                         542
#define P1M                           543
#define P1M0                          544
#define P1M1                          545
#define PWM1CON                       546
#define P1DC                          547
#define P1DC0                         548
#define P1DC1                         549
#define P1DC2                         550
#define P1DC3                         551
#define P1DC4                         552
#define P1DC5                         553
#define P1DC6                         554
#define P1RSEN                        555
#define PSS1BD                        556
#define PSS1BD0                       557
#define PSS1BD1                       558
#define PSS1AC                        559
#define PSS1AC0                       560
#define PSS1AC1                       561
#define CCP1AS                        562
#define CCP1AS0                       563
#define CCP1AS1                       564
#define CCP1AS2                       565
#define CCP1ASE                       566
#define PSTR1CON                      567
#define STR1A                         568
#define STR1B                         569
#define STR1C                         570
#define STR1D                         571
#define STR1SYNC                      572
#define CCPR2L                        573
#define CCPR2H                        574
#define CCP2CON                       575
#define CCP2M                         576
#define CCP2M0                        577
#define CCP2M1                        578
#define CCP2M2                        579
#define CCP2M3                        580
#define DC2B                          581
#define DC2B0                         582
#define DC2B1                         583
#define P2M                           584
#define P2M0                          585
#define P2M1                          586
#define PWM2CON                       587
#define P2DC                          588
#define P2DC0                         589
#define P2DC1                         590
#define P2DC2                         591
#define P2DC3                         592
#define P2DC4                         593
#define P2DC5                         594
#define P2DC6                         595
#define P2RSEN                        596
#define PSS2BD                        597
#define PSS2BD0                       598
#define PSS2BD1                       599
#define PSS2AC0                       600
#define PSS2AC                        601
#define PSS2AC1                       602
#define CCP2AS0                       603
#define CCP2AS                        604
#define CCP2AS1                       605
#define CCP2AS2                       606
#define CCP2ASE                       607
#define PSTR2CON                      608
#define STR2A                         609
#define STR2B                         610
#define STR2C                         611
#define STR2D                         612
#define STR2SYNC                      613
#define CCPTMRS                       614
#define C1TSEL0                       615
#define C1TSEL                        616
#define C1TSEL1                       617
#define C2TSEL0                       618
#define C2TSEL                        619
#define C2TSEL1                       620
#define C3TSEL0                       621
#define C3TSEL                        622
#define C3TSEL1                       623
#define C4TSEL                        624
#define C4TSEL0                       625
#define C4TSEL1                       626
#define CCPR3L                        627
#define CCPR3H                        628
#define CCP3CON                       629
#define CCP3M                         630
#define CCP3M0                        631
#define CCP3M1                        632
#define CCP3M2                        633
#define CCP3M3                        634
#define DC3B                          635
#define DC3B0                         636
#define DC3B1                         637
#define CCPR4L                        638
#define CCPR4H                        639
#define CCP4CON                       640
#define CCP4M                         641
#define CCP4M0                        642
#define CCP4M1                        643
#define CCP4M2                        644
#define CCP4M3                        645
#define DC4B0                         646
#define DC4B                          647
#define DC4B1                         648
#define INLVLA                        649
#define INLVLA0                       650
#define INLVLA1                       651
#define INLVLA2                       652
#define INLVLA3                       653
#define INLVLA4                       654
#define INLVLA5                       655
#define INLVLB4                       656
#define INLVLB                        657
#define INLVLB5                       658
#define INLVLB6                       659
#define INLVLB7                       660
#define INLVLC                        661
#define INLVLC0                       662
#define INLVLC1                       663
#define INLVLC2                       664
#define INLVLC3                       665
#define INLVLC4                       666
#define INLVLC5                       667
#define INLVLC6                       668
#define INLVLC7                       669
#define IOCAP                         670
#define IOCAP0                        671
#define IOCAP1                        672
#define IOCAP2                        673
#define IOCAP3                        674
#define IOCAP4                        675
#define IOCAP5                        676
#define IOCAN0                        677
#define IOCAN                         678
#define IOCAN1                        679
#define IOCAN2                        680
#define IOCAN3                        681
#define IOCAN4                        682
#define IOCAN5                        683
#define IOCAF0                        684
#define IOCAF                         685
#define IOCAF1                        686
#define IOCAF2                        687
#define IOCAF3                        688
#define IOCAF4                        689
#define IOCAF5                        690
#define IOCBP                         691
#define IOCBP4                        692
#define IOCBP5                        693
#define IOCBP6                        694
#define IOCBP7                        695
#define IOCBN4                        696
#define IOCBN                         697
#define IOCBN5                        698
#define IOCBN6                        699
#define IOCBN7                        700
#define IOCBF4                        701
#define IOCBF                         702
#define IOCBF5                        703
#define IOCBF6                        704
#define IOCBF7                        705
#define CLKRCON                       706
#define CLKRDIV                       707
#define CLKRDIV0                      708
#define CLKRDIV1                      709
#define CLKRDIV2                      710
#define CLKRDC                        711
#define CLKRDC0                       712
#define CLKRDC1                       713
#define CLKRSLR                       714
#define CLKROE                        715
#define CLKREN                        716
#define MDCON                         717
#define MDBIT                         718
#define MDOUT                         719
#define MDOPOL                        720
#define MDSLR                         721
#define MDOE                          722
#define MDEN                          723
#define MDSRC                         724
#define MDMS0                         725
#define MDMS                          726
#define MDMS1                         727
#define MDMS2                         728
#define MDMS3                         729
#define MDMSODIS                      730
#define MDCARL                        731
#define MDCL0                         732
#define MDCL                          733
#define MDCL1                         734
#define MDCL2                         735
#define MDCL3                         736
#define MDCLSYNC                      737
#define MDCLPOL                       738
#define MDCLODIS                      739
#define MDCARH                        740
#define MDCH                          741
#define MDCH0                         742
#define MDCH1                         743
#define MDCH2                         744
#define MDCH3                         745
#define MDCHSYNC                      746
#define MDCHPOL                       747
#define MDCHODIS                      748
#define TMR4                          749
#define PR4                           750
#define T4CON                         751
#define T4CKPS0                       752
#define T4CKPS                        753
#define T4CKPS1                       754
#define TMR4ON                        755
#define T4OUTPS                       756
#define T4OUTPS0                      757
#define T4OUTPS1                      758
#define T4OUTPS2                      759
#define T4OUTPS3                      760
#define TMR6                          761
#define PR6                           762
#define T6CON                         763
#define T6CKPS0                       764
#define T6CKPS                        765
#define T6CKPS1                       766
#define TMR6ON                        767
#define T6OUTPS0                      768
#define T6OUTPS                       769
#define T6OUTPS1                      770
#define T6OUTPS2                      771
#define T6OUTPS3                      772
#define STATUS_SHAD                   773
#define C_SHAD                        774
#define DC_SHAD                       775
#define Z_SHAD                        776
#define WREG_SHAD                     777
#define BSR_SHAD                      778
#define PCLATH_SHAD                   779
#define FSR0L_SHAD                    780
#define FSR0H_SHAD                    781
#define FSR1L_SHAD                    782
#define FSR1H_SHAD                    783
#define STKPTR                        784
#define TOSL                          785
#define TOSH                          786

#endif // _PIC16F1829_H_
